#include "common.h"

//CRC16:0xA001 余式表
//--------------------------------------------------------------
// 半字节CRC16(Dow_右移逆序) 余式表:0xA001(0x8005按位颠倒)
//--------------------------------------------------------------
uint16_t CRC16_Tab[] =
{
	0x0000, 0xCC01, 0xD801, 0x1400, 0xF001, 0x3C00, 0x2800, 0xE401,
	0xA001, 0x6C00, 0x7800, 0xB401, 0x5000, 0x9C01, 0x8801, 0x4400
};
//--------------------------------------------------------------
// 函数名称: Calc_Crc16
// 功能描述: 计算单个字节的CRC16
// 输入参数: 输入字节,crc16初始值
// 返回参数: 无
// 修改记录:
// 2015-01-11, PiaoHong 创建函数
//---------------------------------------------------------------
uint16_t Calc_Crc16(uint8_t crcbuf, uint16_t crc_16)
{
	uint8_t temp = ((uint8_t)(crc_16&0x000F))^(crcbuf&0x0F);
	crc_16 >>= 4;
	crc_16 ^= CRC16_Tab[temp];
	temp = ((uint8_t)(crc_16&0x000F))^(crcbuf>>4);
	crc_16 >>= 4;
	crc_16 ^= CRC16_Tab[temp];
	return crc_16;
}
//--------------------------------------------------------------
// 函数名称: Get_CRC16_byGID
// 功能描述: 得到CRC16
// 输入参数: 待进行CRC校验计算的报文 待校验的报文长度
// 返回参数: CRC16
// 修改记录:
// 2015-01-11, PiaoHong 创建函数
//---------------------------------------------------------------
uint16_t Get_CRC16(uint8_t *pBuff, uint16_t len)
{
	uint8_t i;
	uint16_t crc16 = 0xFFFF;
	for (i=0;i<len;i++)
	{
		crc16 = Calc_Crc16(*pBuff++,crc16);
	}
	return crc16;
}
